In [14]:
import pandas as pd

In [15]:
import sys,os
sys.path.append("../scripts/")
from data_extraction import DataFrameManipulator

In [54]:
city_chart  = pd.read_csv('../youtube_data/Cities/Chart data.csv')

In [55]:
city_chart.head(10)

         Date                                 Cities    City name  Views
0  2020-06-28  0x164b85cef5ab402d:0x8467b6b037a24d49  Addis Ababa      0
1  2020-06-29  0x164b85cef5ab402d:0x8467b6b037a24d49  Addis Ababa      0
2  2020-06-30  0x164b85cef5ab402d:0x8467b6b037a24d49  Addis Ababa      0
3  2020-07-01  0x164b85cef5ab402d:0x8467b6b037a24d49  Addis Ababa      0
4  2020-07-02  0x164b85cef5ab402d:0x8467b6b037a24d49  Addis Ababa      0
5  2020-07-03  0x164b85cef5ab402d:0x8467b6b037a24d49  Addis Ababa      0
6  2020-07-04  0x164b85cef5ab402d:0x8467b6b037a24d49  Addis Ababa      0
7  2020-07-05  0x164b85cef5ab402d:0x8467b6b037a24d49  Addis Ababa      0
8  2020-07-06  0x164b85cef5ab402d:0x8467b6b037a24d49  Addis Ababa      0
9  2020-07-07  0x164b85cef5ab402d:0x8467b6b037a24d49  Addis Ababa      0

In [56]:
city_chart.shape

(6395, 4)

In [6]:
def rename_columns(df, new_column_names):
    """
    Rename columns in a Pandas DataFrame.

    Parameters:
    - df: Pandas DataFrame
    - new_column_names: Dictionary of old-to-new column names

    Returns:
    - DataFrame with renamed columns
    """
    df.rename(columns=new_column_names, inplace=True)
    return df

In [58]:
new_column_names = {'Cities': 'city_id', 'City name': 'city_name','Date':'date'}

In [59]:
city_chart  = rename_columns(city_chart,new_column_names)

In [60]:
city_chart.head()

         date                                city_id    city_name  Views
0  2020-06-28  0x164b85cef5ab402d:0x8467b6b037a24d49  Addis Ababa      0
1  2020-06-29  0x164b85cef5ab402d:0x8467b6b037a24d49  Addis Ababa      0
2  2020-06-30  0x164b85cef5ab402d:0x8467b6b037a24d49  Addis Ababa      0
3  2020-07-01  0x164b85cef5ab402d:0x8467b6b037a24d49  Addis Ababa      0
4  2020-07-02  0x164b85cef5ab402d:0x8467b6b037a24d49  Addis Ababa      0

In [61]:
city_table  = pd.read_csv('../youtube_data/Cities/Table data.csv')

In [62]:
city_table.head()

,Cities,City name,Geography,Geography.1,Views,Watch time (hours),Average view duration
0,Total,NaN,NaN,NaN,26625,2157.3497,0:04:51
1,0x164b85cef5ab402d:0x8467b6b037a24d49,Addis Ababa,ET,ET-AA,1252,127.5042,0:06:06
2,0x487a4d4c5226f5db:0xd9be143804fe6baa,Manchester,GB,GB-ENG,23,0.0402,0:00:06
3,0x3568eb6de823cd35:0x35d8cb74247108a7,Busan,KR,KR-26,14,0.0354,0:00:09
4,0x168e8fde9837cabf:0x191f55de7e67db40,Khartoum,SD,SD-KH,12,1.2627,0:06:18

In [63]:
new_column_names = {'Cities': 'city_id','City name': 'city_name','Geography': 'country_code'}

In [65]:
city_table   = rename_columns(city_table,new_column_names)

In [ ]:
city_table.head()

In [5]:
def drop_rows(df, rows_to_drop, by_index=True):
    """
    Drop rows from a Pandas DataFrame.

    Parameters:
    - df: Pandas DataFrame
    - rows_to_drop: List of index labels or row numbers to drop
    - by_index: If True, drop rows by index labels; if False, drop rows by row numbers

    Returns:
    - DataFrame with specified rows dropped
    """
    if by_index:
        df_dropped = df.drop(rows_to_drop)
    else:
        df_dropped = df.drop(df.index[rows_to_drop])

    return df_dropped

In [ ]:
rows_to_drop_by_number = [0]

In [ ]:
city_table = drop_rows(City_type, rows_to_drop_by_number, by_index=False)

In [ ]:
city_table.head()

In [ ]:
def drop_columns(df, columns_to_drop):
    """
    Drop columns from the Pandas DataFrame.

    Parameters:
    - df: Pandas DataFrame
    - columns_to_drop: List of column names to drop

    Returns:
    - Modified DataFrame
    """
    return df.drop(columns=columns_to_drop)

In [ ]:
columns_to_drop = ['Geography.1', 'Views','Watch time (hours)','Average view duration']

In [ ]:
city_table = drop_columns(City_type,columns_to_drop)

In [53]:
city_table.head()

NameError: name 'city_table' is not defined

In [ ]:
city_table.to_csv('../data/city_table.csv',index=False)

In [66]:
a  = pd.read_csv('../youtube_data/Geography/Table data.csv')

In [67]:
a.head()

  Geography  Views  Watch time (hours) Average view duration
0     Total  26625           2157.3497               0:04:51
1        ET  10903            958.4972               0:05:16
2        NG    854            103.8847               0:07:17
3        KE    460             48.0795               0:06:16
4        US    260             11.6346               0:02:41

In [68]:
ab = pd.read_csv('../youtube_data/Sharing service/Chart data.csv')

In [3]:
sharing_service = pd.read_csv('../youtube_data/Sharing service/Chart data.csv')

In [4]:
sharing_service.head()

         Date Sharing service  Shares
0  2020-06-28        Facebook       0
1  2020-06-29        Facebook       0
2  2020-06-30        Facebook       0
3  2020-07-01        Facebook       0
4  2020-07-02        Facebook       0

In [7]:
new_column_names = {'Date':'date','Sharing service':'sharing_service','Share':'share'}

In [8]:
sharing_service = rename_columns(sharing_service,new_column_names)

In [9]:
sharing_service.head()

         date sharing_service  Shares
0  2020-06-28        Facebook       0
1  2020-06-29        Facebook       0
2  2020-06-30        Facebook       0
3  2020-07-01        Facebook       0
4  2020-07-02        Facebook       0

In [11]:
sharing_service.to_csv('../data/sharing_service.csv',index=False)

In [12]:
user_age = pd.read_csv('../youtube_data/Viewer age.csv')

In [13]:
user_age.head()

,Viewer age,Views (%),Average view duration,Average percentage viewed (%),Watch time (hours) (%)
0,13–17 years,0.49,0:00:08,0.27,0.01
1,18–24 years,23.27,0:05:17,9.75,26.91
2,25–34 years,72.70,0:04:30,8.08,71.66
3,35–44 years,3.54,0:01:49,2.83,1.42

In [ ]:
city_chart.csv
city_table.csv
common_table.csv
country_code.csv
device_type.csv

  country_code  views  Watch time (hours) Average view duration
0           ET  10903            958.4972               0:05:16
1           NG    854            103.8847               0:07:17
2           KE    460             48.0795               0:06:16
3           US    260             11.6346               0:02:41
4           IN    228              2.1819               0:00:34